trade_exp/src/Documents/ЗаявкиНаТранспорт/ЗаявкиНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="db72f44e-2b1d-4886-8e97-c4111340a2ba">
  <name>ЗаявкиНаТранспорт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5e88cbaa-1ee6-444e-b962-76bccfaec3ce">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8000e40-1683-4515-8e24-2714af369aee">
    <name>СчетПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d35d7d00-4259-411d-983b-e46999aadf8a">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="141f5d0e-c70c-4cc6-8b8d-9b82f5b09efb">
    <name>ДатаПрибытияНаСкладПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="452f920e-5a9a-46ed-b57b-b943d09373d5">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fab25c7e-c304-4ba4-8a09-32a07e2a1c9c">
    <name>ДатаПрибытияНаПогрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f7005561-37b4-42a9-9d1e-ac45516b5e5d">
    <name>ДатаРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b6e17b41-95c1-4738-b813-e8b5d4cf7897">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0595fd24-1a84-4124-9df2-882d6ce14551">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="862a49e4-6108-452a-8079-2027547dac08">
    <name>ДатаВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="41b035d4-1821-4afd-a766-dde4728c7cc2">
    <name>СтоимостьГруза</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d59a914-a98c-4e9f-992a-aedbb4941c3b">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="edeb18a0-c46b-43f7-af14-39d88316db58">
    <name>ДатаПрибытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="627580a7-f326-4b0b-a18d-c4971421fbce">
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2876bb75-dfca-45f6-b229-615e598b236a">
    <name>КонтактноеЛицоГрузополучателя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b0425133-9b18-4d84-8d7c-838301e32abf">
    <name>АдресОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="099afa53-f0d7-44a3-8ee5-d57c4b17bd6d">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81ac59dd-1e00-4beb-84c4-3c8a83c921c6">
    <name>ЕдИзм</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a1876edd-1ed6-4934-9be7-6b7d213bec46">
    <name>ТранспортнаяКомпания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5859a01d-754c-42ea-b301-703c2aef95df">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a5ceb558-0de2-47fc-b752-6d7467dce7d8">
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf541225-a489-444d-97f8-d649f9246050">
    <name>БанковскийСчетГрузоотправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="41c59710-93a7-4269-9cf9-dbca61a4c7c4">
    <name>АдресПогрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cf62aa26-c7bd-4758-98cf-c3a816edb5be">
    <name>КомментарийЛогиста</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="398c3f8f-e7a1-4364-8a98-b39fe75c9fde">
    <name>НаименованиеТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="816a1c4a-c414-484d-8e0d-cc8df7f2bd16">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0b5d38e2-c258-458e-9fec-a94ffe72846d">
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f31d71b9-a795-47d7-9278-1f6b6984524f">
    <name>ВидЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ff9a06b-96ba-4314-b7c8-a88d50f2f585">
    <name>ФактическаяСтоимостьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="824483ba-ace5-4aa6-94db-28637902c9ff">
    <name>СтоимостьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fe0d0ae-356a-41d6-8c5b-9e49c19bae74">
    <name>КомментарийМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1c813fb1-1b48-4812-9632-f6d67c699390">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efeabc18-2130-4c0e-a665-0e9a752baf53">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f080aaaa-bca5-40e0-86b0-3668e94ab17b">
    <name>ТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Document>

trade_exp/src/Documents/ЗаявкиНаТранспорт/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ВРаботу(Команда)
	
	Если Объект.Статус = 0 тогда
		ПринятьВРаботу();
		ЭтаФорма.Модифицированность = Истина;
	Иначе
		Сообщить("Не возможно принять в работу заявку!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПринятьВРаботу()
	
	Объект.ДатаРаботы = ТекущаяДата();
	Объект.Менеджер = ПараметрыСеанса.ТекущийПользователь;
	Объект.Статус = 1;   
	
КОнецПроцедуры

&НаКлиенте
Процедура Выполнена(Команда)
	
	Если Объект.Статус = 1 тогда
		ВыполнитьЗаявку();
		ЭтаФорма.Модифицированность = Истина;
	Иначе
		Сообщить("Не возможно выполнить заявку!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаявку()
	Объект.ДатаВыполнения = ТекущаяДата();
	Объект.Статус = 2;
КОнецПроцедуры

&НаКлиенте
Процедура Отменена(Команда)
	
	Если Объект.Статус = 1 тогда
		ОтменитьЗаявку();
		ЭтаФорма.Модифицированность = Истина;
	Иначе
		Сообщить("Не возможно отменить заявку!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаявку()
	Объект.ДатаВыполнения = ТекущаяДата();
	Объект.Статус = 3;
КОнецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//При копировании очистим лишнее, заполним правильно реквизиты
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования.Автор) тогда
		Объект.Автор=ПараметрыСеанса.ТекущийПользователь;
		Объект.Дата=ТекущаяДата();
		//Очищаем
		Объект.Основание="";
		Объект.ДатаРаботы="";
		Объект.ДатаВыполнения="";
		Объект.ДатаПрибытия="";
		Объект.ДатаПрибытияНаСкладПлан="";
		Объект.Менеджер="";
		Объект.ТранспортнаяКомпания="";
		Объект.Статус=0;
		Объект.ФактическаяСтоимостьДоставки=0;
		Объект.КомментарийМенеджера="";
	КонецЕсли;
	//
	Если Не ЗначениеЗаполнено(Объект.Автор) тогда
		Объект.Автор=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Дата) тогда
		Объект.Дата=ТекущаяДата()
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОснованиеДокумента = Объект.Основание;
	
	ВидимостьПоставкиНаСклад = Истина;
	
	Если ЗначениеЗаполнено(ОснованиеДокумента) И ТипЗнч(ОснованиеДокумента) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ВидимостьПоставкиНаСклад = Не (Альтерра_СкладСервер.ИспользуетсяНоваяСхемаРаботыСПоставками(ОснованиеДокумента.Дата) ИЛИ Параметры.Ключ.Пустая());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПроверитьРоль() Тогда
		ЭтаФОрма.Элементы.ФормаВРаботу.Доступность = Ложь;
		ЭтаФОрма.Элементы.ФормаВыполнена.Доступность = Ложь;
		ЭтаФОрма.Элементы.ФормаОтменена.Доступность =  Ложь;
		ЭтаФОрма.Элементы.ТранспортнаяКомпания.Доступность = Ложь;
		ЭтаФОрма.Элементы.ФактическаяСтоимостьДоставки.Доступность = Ложь;
		ЭтаФОрма.Элементы.КомментарийМенеджера.Доступность = Ложь;
		ЭтаФОрма.Элементы.ДатаПрибытия.Доступность = Ложь;
		ЭтаФОрма.Элементы.ДатаПоступления.Доступность = Ложь;
	КонецЕсли;
	Если ПроверитьАдминистратора() Тогда
		ЭтаФОрма.Элементы.Статус.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды Не работает
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Функция ПроверитьРоль()
	
	Если РольДоступна("ОтделЛогистики") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьАдминистратора()
	
	Если (ПараметрыСеанса.ТекущийПользователь.Наименование = "Администратор") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;  
	
КонецФункции

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Объект.Поставщик = "";
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	ГрузоотправительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГрузоотправительПриИзмененииНаСервере()
	Объект.БанковскийСчетГрузоотправителя = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Объект.Грузоотправитель);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоОснованию(Команда)
	ОбновитьПоОснованиюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоОснованиюНаСервере()
	Документы.ЗаявкиНаТранспорт.ЗаполнитьДанныеПоОснованию(Объект.Основание, Объект);
КонецПроцедуры
